; ModuleID = 'bfvtr4639hkyqyuhum1odmca2'
source_filename = "bfvtr4639hkyqyuhum1odmca2"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx11.0.0"

%"ppv_lite86::generic::u32x4_generic" = type { [4 x i32] }
%"ppv_lite86::generic::u64x2_generic" = type { [2 x i64] }
%"ppv_lite86::generic::vec128_storage" = type { [2 x i64] }

@alloc_744b4efd401b946b41bfe0f086a596f6 = private unnamed_addr constant <{ [95 x i8] }> <{ [95 x i8] c"/Users/np/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/rand-0.9.0/src/rngs/reseeding.rs" }>, align 1
@alloc_8a8305002a5686bad8b99ad20f996174 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_744b4efd401b946b41bfe0f086a596f6, [16 x i8] c"_\00\00\00\00\00\00\00\AA\00\00\00\09\00\00\00" }>, align 8
@alloc_43fa16c67920968a68e866e96f3f6621 = private unnamed_addr constant <{ [98 x i8] }> <{ [98 x i8] c"/Users/np/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/rand-0.9.0/src/distr/uniform_int.rs" }>, align 1
@alloc_5fc73023334f87bc750c79ae2dfc5958 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_43fa16c67920968a68e866e96f3f6621, [16 x i8] c"b\00\00\00\00\00\00\00\0E\01\00\00\01\00\00\00" }>, align 8
@alloc_b7bef978aede28df3b19e88fa8cc4254 = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_43fa16c67920968a68e866e96f3f6621, [16 x i8] c"b\00\00\00\00\00\00\00\0F\01\00\00\01\00\00\00" }>, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<rand::distr::uniform::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<rand::distr::uniform::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !20, identifier: "9c16e4f66e486d4126dc391768dd495c")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Error", scope: !13, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagEnumClass, elements: !17)
!13 = !DINamespace(name: "uniform", scope: !14)
!14 = !DINamespace(name: "distr", scope: !15)
!15 = !DINamespace(name: "rand", scope: null)
!16 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!17 = !{!18, !19}
!18 = !DIEnumerator(name: "EmptyRange", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "NonFinite", value: 1, isUnsigned: true)
!20 = !{}
!21 = !{i32 8, !"PIC Level", i32 2}
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{!"rustc version 1.85.1 (4eb161250 2025-03-15)"}
!25 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !26, producer: "clang LLVM (rustc version 1.85.1 (4eb161250 2025-03-15))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, globals: !114, splitDebugInlining: false, nameTableKind: None)
!26 = !DIFile(filename: "src/lib.rs/@/bfvtr4639hkyqyuhum1odmca2", directory: "/Users/np/hack/verifopt/flux-examples/flux-assume")
!27 = !{!12, !28, !37, !39, !45}
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !29, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagEnumClass, elements: !32)
!29 = !DINamespace(name: "rt", scope: !30)
!30 = !DINamespace(name: "fmt", scope: !31)
!31 = !DINamespace(name: "core", scope: null)
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !30, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagEnumClass, elements: !38)
!38 = !{!33, !34, !35}
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !40, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagEnumClass, elements: !41)
!40 = !DINamespace(name: "panicking", scope: !31)
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !46, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagEnumClass, elements: !49)
!46 = !DINamespace(name: "alignment", scope: !47)
!47 = !DINamespace(name: "ptr", scope: !31)
!48 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!50 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!54 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!55 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!56 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!57 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!58 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!59 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!60 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!61 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!62 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!63 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!64 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!65 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!66 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!67 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!68 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!69 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!70 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!71 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!72 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!73 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!74 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!75 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!76 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!77 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!78 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!79 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!80 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!81 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!82 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!83 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!84 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!85 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!86 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!87 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!88 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!89 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!90 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!91 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!92 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!93 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!94 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!95 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!96 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!97 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!98 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!99 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!100 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!101 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!102 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!103 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!104 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!105 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!106 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!107 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!108 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!109 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!110 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!111 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!112 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!113 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!114 = !{!0}
!115 = distinct !DISubprogram(name: "generate<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>", linkageName: "_ZN103_$LT$rand..rngs..reseeding..ReseedingCore$LT$R$C$Rsdr$GT$$u20$as$u20$rand_core..block..BlockRngCore$GT$8generate17h0e2eb77e2eeb856aE", scope: !117, file: !116, line: 162, type: !120, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !157, retainedNodes: !169)
!116 = !DIFile(filename: "/Users/np/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/rand-0.9.0/src/rngs/reseeding.rs", directory: "", checksumkind: CSK_MD5, checksum: "f649fbc797145d9e34d9cc4396b624a3")
!117 = !DINamespace(name: "{impl#4}", scope: !118)
!118 = !DINamespace(name: "reseeding", scope: !119)
!119 = !DINamespace(name: "rngs", scope: !15)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !122, !160}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut rand::rngs::reseeding::ReseedingCore<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReseedingCore<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>", scope: !118, file: !2, size: 512, align: 64, flags: DIFlagPrivate, elements: !124, templateParams: !157, identifier: "8d7b2ebfa1811a33c2d7054181c7dea8")
!124 = !{!125, !150, !154, !156}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !123, file: !2, baseType: !126, size: 384, align: 64, flags: DIFlagPrivate)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaCha12Core", scope: !127, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !129, templateParams: !20, identifier: "bc946d025d6ad2b0301a09ea763988c3")
!127 = !DINamespace(name: "chacha", scope: !128)
!128 = !DINamespace(name: "rand_chacha", scope: null)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !126, file: !2, baseType: !131, size: 384, align: 64, flags: DIFlagPrivate)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChaCha", scope: !132, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !133, templateParams: !20, identifier: "6525c8c53c8acd34fcc82ae27672df16")
!132 = !DINamespace(name: "guts", scope: !128)
!133 = !{!134, !148, !149}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !131, file: !2, baseType: !135, size: 128, align: 64, flags: DIFlagProtected)
!135 = !DICompositeType(tag: DW_TAG_union_type, name: "vec128_storage", scope: !136, file: !2, size: 128, align: 64, elements: !138, templateParams: !20, identifier: "899adb876243f8df868531039275a9ea")
!136 = !DINamespace(name: "generic", scope: !137)
!137 = !DINamespace(name: "ppv_lite86", scope: null)
!138 = !{!139, !144}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !135, file: !2, baseType: !140, size: 128, align: 32)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, align: 32, elements: !142)
!141 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!142 = !{!143}
!143 = !DISubrange(count: 4, lowerBound: 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !135, file: !2, baseType: !145, size: 128, align: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, align: 64, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 2, lowerBound: 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !131, file: !2, baseType: !135, size: 128, align: 64, offset: 128, flags: DIFlagProtected)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !131, file: !2, baseType: !135, size: 128, align: 64, offset: 256, flags: DIFlagProtected)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reseeder", scope: !123, file: !2, baseType: !151, align: 8, offset: 512, flags: DIFlagPrivate)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "OsRng", scope: !152, file: !2, align: 8, flags: DIFlagPublic, elements: !20, identifier: "8031d0e05f6b95ade5b51b420ac3194d")
!152 = !DINamespace(name: "os", scope: !153)
!153 = !DINamespace(name: "rand_core", scope: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !123, file: !2, baseType: !155, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!155 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_until_reseed", scope: !123, file: !2, baseType: !155, size: 64, align: 64, offset: 448, flags: DIFlagPrivate)
!157 = !{!158, !159}
!158 = !DITemplateTypeParameter(name: "R", type: !126)
!159 = !DITemplateTypeParameter(name: "Rsdr", type: !151)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut rand_chacha::chacha::Array64<u32>", baseType: !161, size: 64, align: 64, dwarfAddressSpace: 0)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "Array64<u32>", scope: !127, file: !2, size: 2048, align: 32, flags: DIFlagPublic, elements: !162, templateParams: !167, identifier: "171dd5624acf7398fab9ce7a230a4d9c")
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !161, file: !2, baseType: !164, size: 2048, align: 32, flags: DIFlagPrivate)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 2048, align: 32, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 64, lowerBound: 0)
!167 = !{!168}
!168 = !DITemplateTypeParameter(name: "T", type: !141)
!169 = !{!170, !171, !172}
!170 = !DILocalVariable(name: "self", arg: 1, scope: !115, file: !116, line: 162, type: !122)
!171 = !DILocalVariable(name: "results", arg: 2, scope: !115, file: !116, line: 162, type: !160)
!172 = !DILocalVariable(name: "num_bytes", scope: !173, file: !116, line: 169, type: !9, align: 8)
!173 = distinct !DILexicalBlock(scope: !115, file: !116, line: 169, column: 9)
!174 = !DILocation(line: 162, column: 17, scope: !115)
!175 = !DILocation(line: 162, column: 28, scope: !115)
!176 = !DILocation(line: 163, column: 12, scope: !115)
!177 = !DILocation(line: 169, column: 37, scope: !115)
!178 = !DILocation(line: 169, column: 25, scope: !115)
!179 = !DILocation(line: 169, column: 13, scope: !173)
!180 = !DILocation(line: 170, column: 9, scope: !173)
!181 = !DILocation(line: 167, column: 20, scope: !115)
!182 = !DILocation(line: 171, column: 9, scope: !173)
!183 = !DILocation(line: 172, column: 6, scope: !115)
!184 = distinct !DISubprogram(name: "sample_single<rand::rngs::thread::ThreadRng>", linkageName: "_ZN105_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$rand..distr..uniform..SampleRange$LT$usize$GT$$GT$13sample_single17h7b74b8c0a7052301E", scope: !186, file: !185, line: 458, type: !187, scopeLine: 458, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !272, retainedNodes: !269)
!185 = !DIFile(filename: "/Users/np/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/rand-0.9.0/src/distr/uniform.rs", directory: "", checksumkind: CSK_MD5, checksum: "86316dcdf17b8e0b3477ac1272e2ff41")
!186 = !DINamespace(name: "{impl#32}", scope: !13)
!187 = !DISubroutineType(types: !188)
!188 = !{!189, !206, !213}
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, rand::distr::uniform::Error>", scope: !190, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !191, templateParams: !20, identifier: "aca91f8abc1ca58eddb8e3c633421c4")
!190 = !DINamespace(name: "result", scope: !31)
!191 = !{!192}
!192 = !DICompositeType(tag: DW_TAG_variant_part, scope: !189, file: !2, size: 128, align: 64, elements: !193, templateParams: !20, identifier: "4012dad6a6c75e0ef46a7a5699e3bc2d", discriminator: !205)
!193 = !{!194, !201}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !192, file: !2, baseType: !195, size: 128, align: 64, extraData: i128 0)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !189, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !196, templateParams: !198, identifier: "1704d4e8b9ef7c5b503f50765d7fd6ec")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !195, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!198 = !{!199, !200}
!199 = !DITemplateTypeParameter(name: "T", type: !9)
!200 = !DITemplateTypeParameter(name: "E", type: !12)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !192, file: !2, baseType: !202, size: 128, align: 64, extraData: i128 1)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !189, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !203, templateParams: !198, identifier: "61ab1455fe784d7e34f2b8f6d89ba129")
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !202, file: !2, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!205 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagArtificial)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !207, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !209, templateParams: !211, identifier: "82cf32b6087fcbab9aef80755fdaab1b")
!207 = !DINamespace(name: "range", scope: !208)
!208 = !DINamespace(name: "ops", scope: !31)
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !206, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!211 = !{!212}
!212 = !DITemplateTypeParameter(name: "Idx", type: !9)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut rand::rngs::thread::ThreadRng", baseType: !214, size: 64, align: 64, dwarfAddressSpace: 0)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadRng", scope: !215, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !216, templateParams: !20, identifier: "33f5dd8a37ea7ba54143747904a40dd1")
!215 = !DINamespace(name: "thread", scope: !119)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rng", scope: !214, file: !2, baseType: !218, size: 64, align: 64, flags: DIFlagPrivate)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rc<core::cell::UnsafeCell<rand::rngs::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>, alloc::alloc::Global>", scope: !219, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !221, templateParams: !267, identifier: "5be018106040064b946a5bc2dfec833")
!219 = !DINamespace(name: "rc", scope: !220)
!220 = !DINamespace(name: "alloc", scope: null)
!221 = !{!222, !261, !264}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !218, file: !2, baseType: !223, size: 64, align: 64, flags: DIFlagPrivate)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::rc::RcInner<core::cell::UnsafeCell<rand::rngs::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>>>", scope: !224, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !225, templateParams: !259, identifier: "5f4484c78b666fa1a0c4e85356244581")
!224 = !DINamespace(name: "non_null", scope: !47)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !223, file: !2, baseType: !227, size: 64, align: 64, flags: DIFlagPrivate)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::rc::RcInner<core::cell::UnsafeCell<rand::rngs::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>>", baseType: !228, size: 64, align: 64, dwarfAddressSpace: 0)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "RcInner<core::cell::UnsafeCell<rand::rngs::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>>", scope: !219, file: !2, size: 2752, align: 64, flags: DIFlagPrivate, elements: !229, templateParams: !257, identifier: "3278bbb1d3549007cf52ad06d3d1c6be")
!229 = !{!230, !239, !240}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !228, file: !2, baseType: !231, size: 64, align: 64, flags: DIFlagPrivate)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<usize>", scope: !232, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !233, templateParams: !238, identifier: "a19d71840de7ed97aed49d86e7a22ef4")
!232 = !DINamespace(name: "cell", scope: !31)
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !231, file: !2, baseType: !235, size: 64, align: 64, flags: DIFlagPrivate)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !232, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !236, templateParams: !238, identifier: "e0f3d8f87ce6231c4b1b63f98a7a4212")
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !235, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!238 = !{!199}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !228, file: !2, baseType: !231, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !228, file: !2, baseType: !241, size: 2624, align: 64, offset: 128, flags: DIFlagPrivate)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<rand::rngs::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>", scope: !232, file: !2, size: 2624, align: 64, flags: DIFlagPublic, elements: !242, templateParams: !255, identifier: "ef8f12446935c3b2c1c68720eb8781ba")
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !241, file: !2, baseType: !244, size: 2624, align: 64, flags: DIFlagPrivate)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>", scope: !118, file: !2, size: 2624, align: 64, flags: DIFlagPublic, elements: !245, templateParams: !157, identifier: "d0a892fed85324877774ea6a0d6bd1f1")
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !244, file: !2, baseType: !247, size: 2624, align: 64, flags: DIFlagPrivate)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "BlockRng<rand::rngs::reseeding::ReseedingCore<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>", scope: !248, file: !2, size: 2624, align: 64, flags: DIFlagPublic, elements: !249, templateParams: !253, identifier: "2038da5758bc61a06732df2f08adf090")
!248 = !DINamespace(name: "block", scope: !153)
!249 = !{!250, !251, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !247, file: !2, baseType: !161, size: 2048, align: 32, flags: DIFlagPrivate)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !247, file: !2, baseType: !9, size: 64, align: 64, offset: 2560, flags: DIFlagPrivate)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !247, file: !2, baseType: !123, size: 512, align: 64, offset: 2048, flags: DIFlagPublic)
!253 = !{!254}
!254 = !DITemplateTypeParameter(name: "R", type: !123)
!255 = !{!256}
!256 = !DITemplateTypeParameter(name: "T", type: !244)
!257 = !{!258}
!258 = !DITemplateTypeParameter(name: "T", type: !241)
!259 = !{!260}
!260 = !DITemplateTypeParameter(name: "T", type: !228)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !218, file: !2, baseType: !262, align: 8, offset: 64, flags: DIFlagPrivate)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::rc::RcInner<core::cell::UnsafeCell<rand::rngs::reseeding::ReseedingRng<rand_chacha::chacha::ChaCha12Core, rand_core::os::OsRng>>>>", scope: !263, file: !2, align: 8, flags: DIFlagPublic, elements: !20, templateParams: !259, identifier: "4a7bc69280161a819176af4375acd3e6")
!263 = !DINamespace(name: "marker", scope: !31)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !218, file: !2, baseType: !265, align: 8, offset: 64, flags: DIFlagPrivate)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !266, file: !2, align: 8, flags: DIFlagPublic, elements: !20, identifier: "d106883495d37db2d12c87b56fcb26f6")
!266 = !DINamespace(name: "alloc", scope: !220)
!267 = !{!258, !268}
!268 = !DITemplateTypeParameter(name: "A", type: !265)
!269 = !{!270, !271}
!270 = !DILocalVariable(name: "self", arg: 1, scope: !184, file: !185, line: 458, type: !206)
!271 = !DILocalVariable(name: "rng", arg: 2, scope: !184, file: !185, line: 458, type: !213)
!272 = !{!273}
!273 = !DITemplateTypeParameter(name: "R", type: !214)
!274 = !DILocation(line: 458, column: 51, scope: !184)
!275 = !DILocation(line: 458, column: 57, scope: !184)
!276 = !DILocation(line: 459, column: 17, scope: !184)
!277 = !DILocation(line: 460, column: 14, scope: !184)
!278 = distinct !DISubprogram(name: "is_empty", linkageName: "_ZN105_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$rand..distr..uniform..SampleRange$LT$usize$GT$$GT$8is_empty17h23921f4355903150E", scope: !186, file: !185, line: 463, type: !279, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, retainedNodes: !283)
!279 = !DISubroutineType(types: !280)
!280 = !{!281, !282}
!281 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ops::range::RangeTo<usize>", baseType: !206, size: 64, align: 64, dwarfAddressSpace: 0)
!283 = !{!284}
!284 = !DILocalVariable(name: "self", arg: 1, scope: !278, file: !185, line: 463, type: !282)
!285 = !DILocation(line: 463, column: 25, scope: !278)
!286 = !DILocation(line: 464, column: 22, scope: !278)
!287 = !DILocation(line: 464, column: 17, scope: !278)
!288 = !DILocation(line: 465, column: 14, scope: !278)
!289 = distinct !DISubprogram(name: "sample_single<rand::rngs::thread::ThreadRng, u32, u32>", linkageName: "_ZN105_$LT$rand..distr..uniform..int..UniformInt$LT$u32$GT$$u20$as$u20$rand..distr..uniform..UniformSampler$GT$13sample_single17hce01506d13bd404eE", scope: !291, file: !290, line: 153, type: !293, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !317, retainedNodes: !309)
!290 = !DIFile(filename: "/Users/np/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/rand-0.9.0/src/distr/uniform_int.rs", directory: "", checksumkind: CSK_MD5, checksum: "4c89c8781ce74085bef72891188648ed")
!291 = !DINamespace(name: "{impl#23}", scope: !292)
!292 = !DINamespace(name: "int", scope: !13)
!293 = !DISubroutineType(types: !294)
!294 = !{!295, !141, !141, !213}
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, rand::distr::uniform::Error>", scope: !190, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !296, templateParams: !20, identifier: "85b154c0c7e43a6c38da290c24026e78")
!296 = !{!297}
!297 = !DICompositeType(tag: DW_TAG_variant_part, scope: !295, file: !2, size: 64, align: 32, elements: !298, templateParams: !20, identifier: "f12da10952a924877d9e20b72a910d0e", discriminator: !308)
!298 = !{!299, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !297, file: !2, baseType: !300, size: 64, align: 32, extraData: i128 0)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !295, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !301, templateParams: !303, identifier: "351856a62621b4e09396170670cf91fb")
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !300, file: !2, baseType: !141, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!303 = !{!168, !200}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !297, file: !2, baseType: !305, size: 64, align: 32, extraData: i128 1)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !295, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !306, templateParams: !303, identifier: "d7cdf77fff4187b46164b15761c3a2f4")
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !305, file: !2, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!308 = !DIDerivedType(tag: DW_TAG_member, scope: !295, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagArtificial)
!309 = !{!310, !311, !312, !313, !315}
!310 = !DILocalVariable(name: "low_b", arg: 1, scope: !289, file: !290, line: 154, type: !141)
!311 = !DILocalVariable(name: "high_b", arg: 2, scope: !289, file: !290, line: 155, type: !141)
!312 = !DILocalVariable(name: "rng", arg: 3, scope: !289, file: !290, line: 156, type: !213)
!313 = !DILocalVariable(name: "low", scope: !314, file: !290, line: 162, type: !141, align: 4)
!314 = distinct !DILexicalBlock(scope: !289, file: !290, line: 162, column: 17)
!315 = !DILocalVariable(name: "high", scope: !316, file: !290, line: 163, type: !141, align: 4)
!316 = distinct !DILexicalBlock(scope: !314, file: !290, line: 163, column: 17)
!317 = !{!273, !318, !319}
!318 = !DITemplateTypeParameter(name: "B1", type: !141)
!319 = !DITemplateTypeParameter(name: "B2", type: !141)
!320 = !DILocation(line: 154, column: 17, scope: !289)
!321 = !DILocation(line: 155, column: 17, scope: !289)
!322 = !DILocation(line: 156, column: 17, scope: !289)
!323 = !DILocalVariable(name: "self", arg: 1, scope: !324, file: !185, line: 404, type: !328)
!324 = distinct !DISubprogram(name: "borrow<u32>", linkageName: "_ZN79_$LT$Borrowed$u20$as$u20$rand..distr..uniform..SampleBorrow$LT$Borrowed$GT$$GT$6borrow17heaeadcfe45efd3bdE", scope: !325, file: !185, line: 404, type: !326, scopeLine: 404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !330, retainedNodes: !329)
!325 = !DINamespace(name: "{impl#6}", scope: !13)
!326 = !DISubroutineType(types: !327)
!327 = !{!328, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !141, size: 64, align: 64, dwarfAddressSpace: 0)
!329 = !{!323}
!330 = !{!331}
!331 = !DITemplateTypeParameter(name: "Borrowed", type: !141)
!332 = !DILocation(line: 404, column: 15, scope: !324, inlinedAt: !333)
!333 = distinct !DILocation(line: 162, column: 28, scope: !289)
!334 = !DILocation(line: 406, column: 6, scope: !324, inlinedAt: !333)
!335 = !DILocation(line: 168, column: 13, scope: !289)
!336 = !DILocation(line: 162, column: 27, scope: !289)
!337 = !DILocation(line: 162, column: 21, scope: !314)
!338 = !DILocation(line: 404, column: 15, scope: !324, inlinedAt: !339)
!339 = distinct !DILocation(line: 163, column: 29, scope: !314)
!340 = !DILocation(line: 406, column: 6, scope: !324, inlinedAt: !339)
!341 = !DILocation(line: 163, column: 28, scope: !314)
!342 = !DILocation(line: 163, column: 21, scope: !316)
!343 = !DILocation(line: 164, column: 21, scope: !316)
!344 = !DILocation(line: 165, column: 32, scope: !316)
!345 = !DILocation(line: 165, column: 28, scope: !316)
!346 = !DILocation(line: 167, column: 52, scope: !316)
!347 = !DILocation(line: 168, column: 14, scope: !289)
!348 = !DILocation(line: 167, column: 17, scope: !316)
!349 = !DILocation(line: 153, column: 13, scope: !289)
!350 = distinct !DISubprogram(name: "sample_single_inclusive<rand::rngs::thread::ThreadRng, u32, u32>", linkageName: "_ZN105_$LT$rand..distr..uniform..int..UniformInt$LT$u32$GT$$u20$as$u20$rand..distr..uniform..UniformSampler$GT$23sample_single_inclusive17h8b1e4ca36f936ad9E", scope: !291, file: !290, line: 176, type: !293, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !317, retainedNodes: !351)
!351 = !{!352, !353, !354, !355, !357, !359, !361, !363, !364, !366}
!352 = !DILocalVariable(name: "low_b", arg: 1, scope: !350, file: !290, line: 177, type: !141)
!353 = !DILocalVariable(name: "high_b", arg: 2, scope: !350, file: !290, line: 178, type: !141)
!354 = !DILocalVariable(name: "rng", arg: 3, scope: !350, file: !290, line: 179, type: !213)
!355 = !DILocalVariable(name: "low", scope: !356, file: !290, line: 185, type: !141, align: 4)
!356 = distinct !DILexicalBlock(scope: !350, file: !290, line: 185, column: 17)
!357 = !DILocalVariable(name: "high", scope: !358, file: !290, line: 186, type: !141, align: 4)
!358 = distinct !DILexicalBlock(scope: !356, file: !290, line: 186, column: 17)
!359 = !DILocalVariable(name: "range", scope: !360, file: !290, line: 190, type: !141, align: 4)
!360 = distinct !DILexicalBlock(scope: !358, file: !290, line: 190, column: 17)
!361 = !DILocalVariable(name: "result", scope: !362, file: !290, line: 197, type: !141, align: 4)
!362 = distinct !DILexicalBlock(scope: !360, file: !290, line: 197, column: 17)
!363 = !DILocalVariable(name: "lo_order", scope: !362, file: !290, line: 197, type: !141, align: 4)
!364 = !DILocalVariable(name: "new_hi_order", scope: !365, file: !290, line: 202, type: !141, align: 4)
!365 = distinct !DILexicalBlock(scope: !362, file: !290, line: 202, column: 21)
!366 = !DILocalVariable(name: "is_overflow", scope: !367, file: !290, line: 204, type: !281, align: 1)
!367 = distinct !DILexicalBlock(scope: !365, file: !290, line: 204, column: 21)
!368 = !DILocation(line: 177, column: 17, scope: !350)
!369 = !DILocation(line: 178, column: 17, scope: !350)
!370 = !DILocation(line: 179, column: 17, scope: !350)
!371 = !DILocation(line: 197, column: 22, scope: !362)
!372 = !DILocation(line: 404, column: 15, scope: !324, inlinedAt: !373)
!373 = distinct !DILocation(line: 185, column: 28, scope: !350)
!374 = !DILocation(line: 406, column: 6, scope: !324, inlinedAt: !373)
!375 = !DILocation(line: 209, column: 13, scope: !350)
!376 = !DILocation(line: 185, column: 27, scope: !350)
!377 = !DILocation(line: 185, column: 21, scope: !356)
!378 = !DILocation(line: 404, column: 15, scope: !324, inlinedAt: !379)
!379 = distinct !DILocation(line: 186, column: 29, scope: !356)
!380 = !DILocation(line: 406, column: 6, scope: !324, inlinedAt: !379)
!381 = !DILocation(line: 186, column: 28, scope: !356)
!382 = !DILocation(line: 186, column: 21, scope: !358)
!383 = !DILocation(line: 187, column: 21, scope: !358)
!384 = !DILocation(line: 188, column: 32, scope: !358)
!385 = !DILocation(line: 188, column: 28, scope: !358)
!386 = !DILocation(line: 0, scope: !387)
!387 = !DILexicalBlockFile(scope: !358, file: !388, discriminator: 0)
!388 = !DIFile(filename: "src/lib.rs", directory: "/Users/np/hack/verifopt/flux-examples/flux-assume", checksumkind: CSK_MD5, checksum: "1b8216fc8915b15ef5b61b10b8d00c2e")
!389 = !DILocalVariable(name: "self", arg: 1, scope: !390, file: !391, line: 1977, type: !141)
!390 = distinct !DISubprogram(name: "wrapping_sub", linkageName: "_ZN4core3num21_$LT$impl$u20$u32$GT$12wrapping_sub17h6c91c3c0a8bd7ea6E", scope: !392, file: !391, line: 1977, type: !394, scopeLine: 1977, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, retainedNodes: !396)
!391 = !DIFile(filename: "/rustc/4eb161250e340c8f48f66e2b929ef4a5bed7c181/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "40608eb764697ec115542843165a02b8")
!392 = !DINamespace(name: "{impl#8}", scope: !393)
!393 = !DINamespace(name: "num", scope: !31)
!394 = !DISubroutineType(types: !395)
!395 = !{!141, !141, !141}
!396 = !{!389, !397}
!397 = !DILocalVariable(name: "rhs", arg: 2, scope: !390, file: !391, line: 1977, type: !141)
!398 = !DILocation(line: 1977, column: 35, scope: !390, inlinedAt: !399)
!399 = distinct !DILocation(line: 190, column: 29, scope: !358)
!400 = !DILocation(line: 1977, column: 41, scope: !390, inlinedAt: !399)
!401 = !DILocation(line: 1978, column: 13, scope: !390, inlinedAt: !399)
!402 = !DILocation(line: 1979, column: 10, scope: !390, inlinedAt: !399)
!403 = !DILocalVariable(name: "self", arg: 1, scope: !404, file: !391, line: 1936, type: !141)
!404 = distinct !DISubprogram(name: "wrapping_add", linkageName: "_ZN4core3num21_$LT$impl$u20$u32$GT$12wrapping_add17h69ec167434ef3e8dE", scope: !392, file: !391, line: 1936, type: !394, scopeLine: 1936, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, retainedNodes: !405)
!405 = !{!403, !406}
!406 = !DILocalVariable(name: "rhs", arg: 2, scope: !404, file: !391, line: 1936, type: !141)
!407 = !DILocation(line: 1936, column: 35, scope: !404, inlinedAt: !408)
!408 = distinct !DILocation(line: 190, column: 29, scope: !358)
!409 = !DILocation(line: 1936, column: 41, scope: !404, inlinedAt: !408)
!410 = !DILocation(line: 1937, column: 13, scope: !404, inlinedAt: !408)
!411 = !DILocation(line: 1938, column: 10, scope: !404, inlinedAt: !408)
!412 = !DILocation(line: 190, column: 29, scope: !358)
!413 = !DILocation(line: 190, column: 21, scope: !360)
!414 = !DILocation(line: 191, column: 20, scope: !360)
!415 = !DILocation(line: 193, column: 31, scope: !360)
!416 = !DILocation(line: 197, column: 46, scope: !360)
!417 = !DILocation(line: 193, column: 28, scope: !360)
!418 = !DILocation(line: 209, column: 14, scope: !350)
!419 = !DILocalVariable(name: "self", arg: 1, scope: !420, file: !421, line: 28, type: !141)
!420 = distinct !DISubprogram(name: "wmul", linkageName: "_ZN60_$LT$u32$u20$as$u20$rand..distr..utils..WideningMultiply$GT$4wmul17h03d200e1b7ae410aE", scope: !422, file: !421, line: 28, type: !424, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, retainedNodes: !430)
!421 = !DIFile(filename: "/Users/np/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/rand-0.9.0/src/distr/utils.rs", directory: "", checksumkind: CSK_MD5, checksum: "402345cc30b17fc8d3e61f54aa4236b5")
!422 = !DINamespace(name: "{impl#5}", scope: !423)
!423 = !DINamespace(name: "utils", scope: !14)
!424 = !DISubroutineType(types: !425)
!425 = !{!426, !141, !141}
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u32, u32)", file: !2, size: 64, align: 32, elements: !427, templateParams: !20, identifier: "17be3570ed04f451565b4d5e18e8cfe4")
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !426, file: !2, baseType: !141, size: 32, align: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !426, file: !2, baseType: !141, size: 32, align: 32, offset: 32)
!430 = !{!419, !431, !432}
!431 = !DILocalVariable(name: "x", arg: 2, scope: !420, file: !421, line: 28, type: !141)
!432 = !DILocalVariable(name: "tmp", scope: !433, file: !421, line: 29, type: !48, align: 8)
!433 = distinct !DILexicalBlock(scope: !420, file: !421, line: 29, column: 17)
!434 = !DILocation(line: 28, column: 21, scope: !420, inlinedAt: !435)
!435 = distinct !DILocation(line: 197, column: 46, scope: !360)
!436 = !DILocation(line: 28, column: 27, scope: !420, inlinedAt: !435)
!437 = !DILocation(line: 29, column: 27, scope: !420, inlinedAt: !435)
!438 = !DILocation(line: 29, column: 45, scope: !420, inlinedAt: !435)
!439 = !DILocation(line: 29, column: 21, scope: !433, inlinedAt: !435)
!440 = !DILocation(line: 30, column: 18, scope: !433, inlinedAt: !435)
!441 = !DILocation(line: 30, column: 42, scope: !433, inlinedAt: !435)
!442 = !DILocation(line: 31, column: 14, scope: !420, inlinedAt: !435)
!443 = !DILocation(line: 197, column: 22, scope: !360)
!444 = !DILocation(line: 197, column: 34, scope: !360)
!445 = !DILocation(line: 197, column: 34, scope: !362)
!446 = !DILocalVariable(name: "self", arg: 1, scope: !447, file: !391, line: 2164, type: !141)
!447 = distinct !DISubprogram(name: "wrapping_neg", linkageName: "_ZN4core3num21_$LT$impl$u20$u32$GT$12wrapping_neg17hd05f9ff01b535572E", scope: !392, file: !391, line: 2164, type: !448, scopeLine: 2164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, retainedNodes: !450)
!448 = !DISubroutineType(types: !449)
!449 = !{!141, !141}
!450 = !{!446}
!451 = !DILocation(line: 2164, column: 35, scope: !447, inlinedAt: !452)
!452 = distinct !DILocation(line: 200, column: 31, scope: !362)
!453 = !DILocation(line: 1978, column: 13, scope: !454, inlinedAt: !455)
!454 = distinct !DISubprogram(name: "wrapping_sub", linkageName: "_ZN4core3num21_$LT$impl$u20$u32$GT$12wrapping_sub17h6c91c3c0a8bd7ea6E", scope: !392, file: !391, line: 1977, type: !394, scopeLine: 1977, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20)
!455 = distinct !DILocation(line: 2165, column: 27, scope: !447, inlinedAt: !452)
!456 = !DILocation(line: 2166, column: 10, scope: !447, inlinedAt: !452)
!457 = !DILocation(line: 200, column: 20, scope: !362)
!458 = !DILocation(line: 208, column: 37, scope: !362)
!459 = !DILocation(line: 1936, column: 35, scope: !404, inlinedAt: !460)
!460 = distinct !DILocation(line: 208, column: 20, scope: !362)
!461 = !DILocation(line: 1936, column: 41, scope: !404, inlinedAt: !460)
!462 = !DILocation(line: 1937, column: 13, scope: !404, inlinedAt: !460)
!463 = !DILocation(line: 1938, column: 10, scope: !404, inlinedAt: !460)
!464 = !DILocation(line: 202, column: 45, scope: !362)
!465 = !DILocation(line: 28, column: 21, scope: !420, inlinedAt: !466)
!466 = distinct !DILocation(line: 202, column: 45, scope: !362)
!467 = !DILocation(line: 28, column: 27, scope: !420, inlinedAt: !466)
!468 = !DILocation(line: 29, column: 27, scope: !420, inlinedAt: !466)
!469 = !DILocation(line: 29, column: 45, scope: !420, inlinedAt: !466)
!470 = !DILocation(line: 29, column: 21, scope: !433, inlinedAt: !466)
!471 = !DILocation(line: 30, column: 18, scope: !433, inlinedAt: !466)
!472 = !DILocation(line: 30, column: 42, scope: !433, inlinedAt: !466)
!473 = !DILocation(line: 31, column: 14, scope: !420, inlinedAt: !466)
!474 = !DILocation(line: 202, column: 26, scope: !362)
!475 = !DILocation(line: 202, column: 26, scope: !365)
!476 = !DILocation(line: 204, column: 39, scope: !365)
!477 = !DILocation(line: 204, column: 25, scope: !367)
!478 = !DILocation(line: 205, column: 31, scope: !367)
!479 = !DILocation(line: 205, column: 21, scope: !367)
!480 = !DILocation(line: 200, column: 17, scope: !362)
!481 = !DILocation(line: 208, column: 17, scope: !362)
!482 = !DILocation(line: 176, column: 13, scope: !350)
!483 = distinct !DISubprogram(name: "sample_single<rand::rngs::thread::ThreadRng, u64, u64>", linkageName: "_ZN105_$LT$rand..distr..uniform..int..UniformInt$LT$u64$GT$$u20$as$u20$rand..distr..uniform..UniformSampler$GT$13sample_single17h5038fe5131663a3aE", scope: !484, file: !290, line: 153, type: !485, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !510, retainedNodes: !502)
!484 = !DINamespace(name: "{impl#25}", scope: !292)
!485 = !DISubroutineType(types: !486)
!486 = !{!487, !48, !48, !213}
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, rand::distr::uniform::Error>", scope: !190, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !488, templateParams: !20, identifier: "495a75d5a60e8d05d1aa59b9ae7b8f1d")
!488 = !{!489}
!489 = !DICompositeType(tag: DW_TAG_variant_part, scope: !487, file: !2, size: 128, align: 64, elements: !490, templateParams: !20, identifier: "3837d502df2402fbc6fbb2294d7e7bd1", discriminator: !501)
!490 = !{!491, !497}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !489, file: !2, baseType: !492, size: 128, align: 64, extraData: i128 0)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !487, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !493, templateParams: !495, identifier: "73e257bf5b25116ddb70b83e2ee721d8")
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !492, file: !2, baseType: !48, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!495 = !{!496, !200}
!496 = !DITemplateTypeParameter(name: "T", type: !48)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !489, file: !2, baseType: !498, size: 128, align: 64, extraData: i128 1)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !487, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !499, templateParams: !495, identifier: "3318701d44f72c68a813b66e18374b1e")
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !498, file: !2, baseType: !12, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!501 = !DIDerivedType(tag: DW_TAG_member, scope: !487, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagArtificial)
!502 = !{!503, !504, !505, !506, !508}
!503 = !DILocalVariable(name: "low_b", arg: 1, scope: !483, file: !290, line: 154, type: !48)
!504 = !DILocalVariable(name: "high_b", arg: 2, scope: !483, file: !290, line: 155, type: !48)
!505 = !DILocalVariable(name: "rng", arg: 3, scope: !483, file: !290, line: 156, type: !213)
!506 = !DILocalVariable(name: "low", scope: !507, file: !290, line: 162, type: !48, align: 8)
!507 = distinct !DILexicalBlock(scope: !483, file: !290, line: 162, column: 17)
!508 = !DILocalVariable(name: "high", scope: !509, file: !290, line: 163, type: !48, align: 8)
!509 = distinct !DILexicalBlock(scope: !507, file: !290, line: 163, column: 17)
!510 = !{!273, !511, !512}
!511 = !DITemplateTypeParameter(name: "B1", type: !48)
!512 = !DITemplateTypeParameter(name: "B2", type: !48)
!513 = !DILocation(line: 154, column: 17, scope: !483)
!514 = !DILocation(line: 155, column: 17, scope: !483)
!515 = !DILocation(line: 156, column: 17, scope: !483)
!516 = !DILocalVariable(name: "self", arg: 1, scope: !517, file: !185, line: 404, type: !520)
!517 = distinct !DISubprogram(name: "borrow<u64>", linkageName: "_ZN79_$LT$Borrowed$u20$as$u20$rand..distr..uniform..SampleBorrow$LT$Borrowed$GT$$GT$6borrow17h875fda3f710bac5cE", scope: !325, file: !185, line: 404, type: !518, scopeLine: 404, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !522, retainedNodes: !521)
!518 = !DISubroutineType(types: !519)
!519 = !{!520, !520}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !48, size: 64, align: 64, dwarfAddressSpace: 0)
!521 = !{!516}
!522 = !{!523}
!523 = !DITemplateTypeParameter(name: "Borrowed", type: !48)
!524 = !DILocation(line: 404, column: 15, scope: !517, inlinedAt: !525)
!525 = distinct !DILocation(line: 162, column: 28, scope: !483)
!526 = !DILocation(line: 406, column: 6, scope: !517, inlinedAt: !525)
!527 = !DILocation(line: 168, column: 13, scope: !483)
!528 = !DILocation(line: 162, column: 27, scope: !483)
!529 = !DILocation(line: 162, column: 21, scope: !507)
!530 = !DILocation(line: 404, column: 15, scope: !517, inlinedAt: !531)
!531 = distinct !DILocation(line: 163, column: 29, scope: !507)
!532 = !DILocation(line: 406, column: 6, scope: !517, inlinedAt: !531)
!533 = !DILocation(line: 163, column: 28, scope: !507)
!534 = !DILocation(line: 163, column: 21, scope: !509)
!535 = !DILocation(line: 164, column: 21, scope: !509)
!536 = !DILocation(line: 165, column: 32, scope: !509)
!537 = !DILocation(line: 165, column: 28, scope: !509)
!538 = !DILocation(line: 167, column: 52, scope: !509)
!539 = !DILocation(line: 168, column: 14, scope: !483)
!540 = !DILocation(line: 167, column: 17, scope: !509)
!541 = !DILocation(line: 153, column: 13, scope: !483)
!542 = distinct !DISubprogram(name: "sample_single_inclusive<rand::rngs::thread::ThreadRng, u64, u64>", linkageName: "_ZN105_$LT$rand..distr..uniform..int..UniformInt$LT$u64$GT$$u20$as$u20$rand..distr..uniform..UniformSampler$GT$23sample_single_inclusive17h6296b6f724fd62b9E", scope: !484, file: !290, line: 176, type: !485, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !510, retainedNodes: !543)
!543 = !{!544, !545, !546, !547, !549, !551, !553, !555, !556, !558}
!544 = !DILocalVariable(name: "low_b", arg: 1, scope: !542, file: !290, line: 177, type: !48)
!545 = !DILocalVariable(name: "high_b", arg: 2, scope: !542, file: !290, line: 178, type: !48)
!546 = !DILocalVariable(name: "rng", arg: 3, scope: !542, file: !290, line: 179, type: !213)
!547 = !DILocalVariable(name: "low", scope: !548, file: !290, line: 185, type: !48, align: 8)
!548 = distinct !DILexicalBlock(scope: !542, file: !290, line: 185, column: 17)
!549 = !DILocalVariable(name: "high", scope: !550, file: !290, line: 186, type: !48, align: 8)
!550 = distinct !DILexicalBlock(scope: !548, file: !290, line: 186, column: 17)
!551 = !DILocalVariable(name: "range", scope: !552, file: !290, line: 190, type: !48, align: 8)
!552 = distinct !DILexicalBlock(scope: !550, file: !290, line: 190, column: 17)
!553 = !DILocalVariable(name: "result", scope: !554, file: !290, line: 197, type: !48, align: 8)
!554 = distinct !DILexicalBlock(scope: !552, file: !290, line: 197, column: 17)
!555 = !DILocalVariable(name: "lo_order", scope: !554, file: !290, line: 197, type: !48, align: 8)
!556 = !DILocalVariable(name: "new_hi_order", scope: !557, file: !290, line: 202, type: !48, align: 8)
!557 = distinct !DILexicalBlock(scope: !554, file: !290, line: 202, column: 21)
!558 = !DILocalVariable(name: "is_overflow", scope: !559, file: !290, line: 204, type: !281, align: 1)
!559 = distinct !DILexicalBlock(scope: !557, file: !290, line: 204, column: 21)
!560 = !DILocation(line: 177, column: 17, scope: !542)
!561 = !DILocation(line: 178, column: 17, scope: !542)
!562 = !DILocation(line: 179, column: 17, scope: !542)
!563 = !DILocation(line: 197, column: 22, scope: !554)
!564 = !DILocation(line: 404, column: 15, scope: !517, inlinedAt: !565)
!565 = distinct !DILocation(line: 185, column: 28, scope: !542)
!566 = !DILocation(line: 406, column: 6, scope: !517, inlinedAt: !565)
!567 = !DILocation(line: 209, column: 13, scope: !542)
!568 = !DILocation(line: 185, column: 27, scope: !542)
!569 = !DILocation(line: 185, column: 21, scope: !548)
!570 = !DILocation(line: 404, column: 15, scope: !517, inlinedAt: !571)
!571 = distinct !DILocation(line: 186, column: 29, scope: !548)
!572 = !DILocation(line: 406, column: 6, scope: !517, inlinedAt: !571)
!573 = !DILocation(line: 186, column: 28, scope: !548)
!574 = !DILocation(line: 186, column: 21, scope: !550)
!575 = !DILocation(line: 187, column: 21, scope: !550)
!576 = !DILocation(line: 188, column: 32, scope: !550)
!577 = !DILocation(line: 188, column: 28, scope: !550)
!578 = !DILocation(line: 0, scope: !579)
!579 = !DILexicalBlockFile(scope: !550, file: !388, discriminator: 0)
!580 = !DILocalVariable(name: "self", arg: 1, scope: !581, file: !391, line: 1977, type: !48)
!581 = distinct !DISubprogram(name: "wrapping_sub", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$12wrapping_sub17hbf3bb29e38134006E", scope: !582, file: !391, line: 1977, type: !583, scopeLine: 1977, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, retainedNodes: !585)
!582 = !DINamespace(name: "{impl#9}", scope: !393)
!583 = !DISubroutineType(types: !584)
!584 = !{!48, !48, !48}
!585 = !{!580, !586}
!586 = !DILocalVariable(name: "rhs", arg: 2, scope: !581, file: !391, line: 1977, type: !48)
!587 = !DILocation(line: 1977, column: 35, scope: !581, inlinedAt: !588)
!588 = distinct !DILocation(line: 190, column: 29, scope: !550)
!589 = !DILocation(line: 1977, column: 41, scope: !581, inlinedAt: !588)
!590 = !DILocation(line: 1978, column: 13, scope: !581, inlinedAt: !588)
!591 = !DILocation(line: 1979, column: 10, scope: !581, inlinedAt: !588)
!592 = !DILocalVariable(name: "self", arg: 1, scope: !593, file: !391, line: 1936, type: !48)
!593 = distinct !DISubprogram(name: "wrapping_add", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$12wrapping_add17he119eb7cca446543E", scope: !582, file: !391, line: 1936, type: !583, scopeLine: 1936, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, retainedNodes: !594)
!594 = !{!592, !595}
!595 = !DILocalVariable(name: "rhs", arg: 2, scope: !593, file: !391, line: 1936, type: !48)
!596 = !DILocation(line: 1936, column: 35, scope: !593, inlinedAt: !597)
!597 = distinct !DILocation(line: 190, column: 29, scope: !550)
!598 = !DILocation(line: 1936, column: 41, scope: !593, inlinedAt: !597)
!599 = !DILocation(line: 1937, column: 13, scope: !593, inlinedAt: !597)
!600 = !DILocation(line: 1938, column: 10, scope: !593, inlinedAt: !597)
!601 = !DILocation(line: 190, column: 29, scope: !550)
!602 = !DILocation(line: 190, column: 21, scope: !552)
!603 = !DILocation(line: 191, column: 20, scope: !552)
!604 = !DILocation(line: 193, column: 31, scope: !552)
!605 = !DILocation(line: 197, column: 46, scope: !552)
!606 = !DILocation(line: 193, column: 28, scope: !552)
!607 = !DILocation(line: 209, column: 14, scope: !542)
!608 = !DILocalVariable(name: "self", arg: 1, scope: !609, file: !421, line: 28, type: !48)
!609 = distinct !DISubprogram(name: "wmul", linkageName: "_ZN60_$LT$u64$u20$as$u20$rand..distr..utils..WideningMultiply$GT$4wmul17h58f2ab47cedcd655E", scope: !610, file: !421, line: 28, type: !611, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, retainedNodes: !617)
!610 = !DINamespace(name: "{impl#6}", scope: !423)
!611 = !DISubroutineType(types: !612)
!612 = !{!613, !48, !48}
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, u64)", file: !2, size: 128, align: 64, elements: !614, templateParams: !20, identifier: "f2337817de4d53af9da5828179fbac1e")
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !613, file: !2, baseType: !48, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !613, file: !2, baseType: !48, size: 64, align: 64, offset: 64)
!617 = !{!608, !618, !619}
!618 = !DILocalVariable(name: "x", arg: 2, scope: !609, file: !421, line: 28, type: !48)
!619 = !DILocalVariable(name: "tmp", scope: !620, file: !421, line: 29, type: !621, align: 16)
!620 = distinct !DILexicalBlock(scope: !609, file: !421, line: 29, column: 17)
!621 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!622 = !DILocation(line: 28, column: 21, scope: !609, inlinedAt: !623)
!623 = distinct !DILocation(line: 197, column: 46, scope: !552)
!624 = !DILocation(line: 28, column: 27, scope: !609, inlinedAt: !623)
!625 = !DILocation(line: 29, column: 27, scope: !609, inlinedAt: !623)
!626 = !DILocation(line: 29, column: 45, scope: !609, inlinedAt: !623)
!627 = !DILocation(line: 29, column: 21, scope: !620, inlinedAt: !623)
!628 = !DILocation(line: 30, column: 18, scope: !620, inlinedAt: !623)
!629 = !DILocation(line: 30, column: 42, scope: !620, inlinedAt: !623)
!630 = !DILocation(line: 31, column: 14, scope: !609, inlinedAt: !623)
!631 = !DILocation(line: 197, column: 22, scope: !552)
!632 = !DILocation(line: 197, column: 34, scope: !552)
!633 = !DILocation(line: 197, column: 34, scope: !554)
!634 = !DILocalVariable(name: "self", arg: 1, scope: !635, file: !391, line: 2164, type: !48)
!635 = distinct !DISubprogram(name: "wrapping_neg", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$12wrapping_neg17ha3ef752ea7b9b3d1E", scope: !582, file: !391, line: 2164, type: !636, scopeLine: 2164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, retainedNodes: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!48, !48}
!638 = !{!634}
!639 = !DILocation(line: 2164, column: 35, scope: !635, inlinedAt: !640)
!640 = distinct !DILocation(line: 200, column: 31, scope: !554)
!641 = !DILocation(line: 1978, column: 13, scope: !642, inlinedAt: !643)
!642 = distinct !DISubprogram(name: "wrapping_sub", linkageName: "_ZN4core3num21_$LT$impl$u20$u64$GT$12wrapping_sub17hbf3bb29e38134006E", scope: !582, file: !391, line: 1977, type: !583, scopeLine: 1977, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20)
!643 = distinct !DILocation(line: 2165, column: 27, scope: !635, inlinedAt: !640)
!644 = !DILocation(line: 2166, column: 10, scope: !635, inlinedAt: !640)
!645 = !DILocation(line: 200, column: 20, scope: !554)
!646 = !DILocation(line: 208, column: 37, scope: !554)
!647 = !DILocation(line: 1936, column: 35, scope: !593, inlinedAt: !648)
!648 = distinct !DILocation(line: 208, column: 20, scope: !554)
!649 = !DILocation(line: 1936, column: 41, scope: !593, inlinedAt: !648)
!650 = !DILocation(line: 1937, column: 13, scope: !593, inlinedAt: !648)
!651 = !DILocation(line: 1938, column: 10, scope: !593, inlinedAt: !648)
!652 = !DILocation(line: 202, column: 45, scope: !554)
!653 = !DILocation(line: 28, column: 21, scope: !609, inlinedAt: !654)
!654 = distinct !DILocation(line: 202, column: 45, scope: !554)
!655 = !DILocation(line: 28, column: 27, scope: !609, inlinedAt: !654)
!656 = !DILocation(line: 29, column: 27, scope: !609, inlinedAt: !654)
!657 = !DILocation(line: 29, column: 45, scope: !609, inlinedAt: !654)
!658 = !DILocation(line: 29, column: 21, scope: !620, inlinedAt: !654)
!659 = !DILocation(line: 30, column: 18, scope: !620, inlinedAt: !654)
!660 = !DILocation(line: 30, column: 42, scope: !620, inlinedAt: !654)
!661 = !DILocation(line: 31, column: 14, scope: !609, inlinedAt: !654)
!662 = !DILocation(line: 202, column: 26, scope: !554)
!663 = !DILocation(line: 202, column: 26, scope: !557)
!664 = !DILocation(line: 204, column: 39, scope: !557)
!665 = !DILocation(line: 204, column: 25, scope: !559)
!666 = !DILocation(line: 205, column: 31, scope: !559)
!667 = !DILocation(line: 205, column: 21, scope: !559)
!668 = !DILocation(line: 200, column: 17, scope: !554)
!669 = !DILocation(line: 208, column: 17, scope: !554)
!670 = !DILocation(line: 176, column: 13, scope: !542)
!671 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<usize>>", linkageName: "_ZN110_$LT$core..iter..adapters..enumerate..Enumerate$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hdbfacb10d82c8040E", scope: !673, file: !672, line: 46, type: !677, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !717, retainedNodes: !719)
!672 = !DIFile(filename: "/rustc/4eb161250e340c8f48f66e2b929ef4a5bed7c181/library/core/src/iter/adapters/enumerate.rs", directory: "", checksumkind: CSK_MD5, checksum: "71ec13eedd8ba0087868184bac290d50")
!673 = !DINamespace(name: "{impl#1}", scope: !674)
!674 = !DINamespace(name: "enumerate", scope: !675)
!675 = !DINamespace(name: "adapters", scope: !676)
!676 = !DINamespace(name: "iter", scope: !31)
!677 = !DISubroutineType(types: !678)
!678 = !{!679, !698}
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(usize, &usize)>", scope: !680, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !681, templateParams: !20, identifier: "efd1c1c17ab449f49628690aa545c990")
!680 = !DINamespace(name: "option", scope: !31)
!681 = !{!682}
!682 = !DICompositeType(tag: DW_TAG_variant_part, scope: !679, file: !2, size: 128, align: 64, elements: !683, templateParams: !20, identifier: "eef449642c8f4cc69bce6c13f361d655", discriminator: !697)
!683 = !{!684, !693}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !682, file: !2, baseType: !685, size: 128, align: 64, extraData: i128 0)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !679, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !20, templateParams: !686, identifier: "a7bf4afb2951d4436a294b203f55fc9d")
!686 = !{!687}
!687 = !DITemplateTypeParameter(name: "T", type: !688)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, &usize)", file: !2, size: 128, align: 64, elements: !689, templateParams: !20, identifier: "7f45528647bc9c989099b4f19ec8d919")
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !688, file: !2, baseType: !9, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !688, file: !2, baseType: !692, size: 64, align: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !682, file: !2, baseType: !694, size: 128, align: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !679, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !695, templateParams: !686, identifier: "740d2ee87928bd8332e39ca4c1ea054")
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !694, file: !2, baseType: !688, size: 128, align: 64, flags: DIFlagPublic)
!697 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !2, baseType: !48, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::enumerate::Enumerate<core::slice::iter::Iter<usize>>", baseType: !699, size: 64, align: 64, dwarfAddressSpace: 0)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Enumerate<core::slice::iter::Iter<usize>>", scope: !674, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !700, templateParams: !717, identifier: "a1059db3428737ed854fb5748bb7aba0")
!700 = !{!701, !716}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !699, file: !2, baseType: !702, size: 128, align: 64, flags: DIFlagPrivate)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<usize>", scope: !703, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !705, templateParams: !238, identifier: "f0116c043585dba1ea779a31e38906c3")
!703 = !DINamespace(name: "iter", scope: !704)
!704 = !DINamespace(name: "slice", scope: !31)
!705 = !{!706, !711, !712}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !702, file: !2, baseType: !707, size: 64, align: 64, flags: DIFlagPrivate)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<usize>", scope: !224, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !708, templateParams: !238, identifier: "72a6afb19cd649ed44932b6d395c604e")
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !707, file: !2, baseType: !710, size: 64, align: 64, flags: DIFlagPrivate)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !702, file: !2, baseType: !710, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !702, file: !2, baseType: !713, align: 8, offset: 128, flags: DIFlagPrivate)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&usize>", scope: !263, file: !2, align: 8, flags: DIFlagPublic, elements: !20, templateParams: !714, identifier: "c503eb076c9b054c1cab277283dd76b")
!714 = !{!715}
!715 = !DITemplateTypeParameter(name: "T", type: !692)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !699, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!717 = !{!718}
!718 = !DITemplateTypeParameter(name: "I", type: !702)
!719 = !{!720, !721, !723, !741, !743}
!720 = !DILocalVariable(name: "self", arg: 1, scope: !671, file: !672, line: 46, type: !698)
!721 = !DILocalVariable(name: "a", scope: !722, file: !672, line: 47, type: !692, align: 8)
!722 = distinct !DILexicalBlock(scope: !671, file: !672, line: 47, column: 9)
!723 = !DILocalVariable(name: "residual", scope: !724, file: !672, line: 47, type: !725, align: 1)
!724 = distinct !DILexicalBlock(scope: !671, file: !672, line: 47, column: 33)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::convert::Infallible>", scope: !680, file: !2, align: 8, flags: DIFlagPublic, elements: !726, templateParams: !20, identifier: "ceba1abf650e2b349b1e4668694d21c1")
!726 = !{!727}
!727 = !DICompositeType(tag: DW_TAG_variant_part, scope: !725, file: !2, align: 8, elements: !728, templateParams: !20, identifier: "bd6e0c2727cc73a8399b5f84c87300ed")
!728 = !{!729, !737}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !727, file: !2, baseType: !730, align: 8)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !725, file: !2, align: 8, flags: DIFlagPublic, elements: !20, templateParams: !731, identifier: "d6b8cdb344e86c64342abcb3377c1286")
!731 = !{!732}
!732 = !DITemplateTypeParameter(name: "T", type: !733)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !734, file: !2, align: 8, flags: DIFlagPublic, elements: !735, templateParams: !20, identifier: "4af98119945805037ef9ad76588c4f12")
!734 = !DINamespace(name: "convert", scope: !31)
!735 = !{!736}
!736 = !DICompositeType(tag: DW_TAG_variant_part, scope: !733, file: !2, align: 8, elements: !20, identifier: "39fe4d87e9cb4cc496c9417ab220a4de")
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !727, file: !2, baseType: !738, align: 8)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !725, file: !2, align: 8, flags: DIFlagPublic, elements: !739, templateParams: !731, identifier: "8c309b541812bcd3524b5a8c70c4b13")
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !738, file: !2, baseType: !733, align: 8, flags: DIFlagPublic)
!741 = !DILocalVariable(name: "val", scope: !742, file: !672, line: 47, type: !692, align: 8)
!742 = distinct !DILexicalBlock(scope: !671, file: !672, line: 47, column: 17)
!743 = !DILocalVariable(name: "i", scope: !744, file: !672, line: 48, type: !9, align: 8)
!744 = distinct !DILexicalBlock(scope: !722, file: !672, line: 48, column: 9)
!745 = !DILocation(line: 46, column: 13, scope: !671)
!746 = !DILocalVariable(name: "self", arg: 1, scope: !747, file: !748, line: 2486, type: !769)
!747 = distinct !DISubprogram(name: "branch<&usize>", linkageName: "_ZN75_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..Try$GT$6branch17hee68539135cb14eeE", scope: !749, file: !748, line: 2486, type: !750, scopeLine: 2486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !714, retainedNodes: !780)
!748 = !DIFile(filename: "/rustc/4eb161250e340c8f48f66e2b929ef4a5bed7c181/library/core/src/option.rs", directory: "", checksumkind: CSK_MD5, checksum: "524921130fd718ea464d7d6978dc9389")
!749 = !DINamespace(name: "{impl#39}", scope: !680)
!750 = !DISubroutineType(types: !751)
!751 = !{!752, !769}
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "ControlFlow<core::option::Option<core::convert::Infallible>, &usize>", scope: !753, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !754, templateParams: !20, identifier: "fe6a0f5844b381473bf999dad63c4b17")
!753 = !DINamespace(name: "control_flow", scope: !208)
!754 = !{!755}
!755 = !DICompositeType(tag: DW_TAG_variant_part, scope: !752, file: !2, size: 64, align: 64, elements: !756, templateParams: !20, identifier: "62064cebecf5e6b1b9b8308231c9bcf9", discriminator: !768)
!756 = !{!757, !764}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Continue", scope: !755, file: !2, baseType: !758, size: 64, align: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !752, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !759, templateParams: !761, identifier: "59c70f9326ef7dd77026090e9ff3db90")
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !758, file: !2, baseType: !692, size: 64, align: 64, flags: DIFlagPublic)
!761 = !{!762, !763}
!762 = !DITemplateTypeParameter(name: "B", type: !725)
!763 = !DITemplateTypeParameter(name: "C", type: !692)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Break", scope: !755, file: !2, baseType: !765, size: 64, align: 64, extraData: i128 0)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "Break", scope: !752, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !766, templateParams: !761, identifier: "e31bcb531ba2080933b85c2321c02cf3")
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !765, file: !2, baseType: !725, align: 8, flags: DIFlagPublic)
!768 = !DIDerivedType(tag: DW_TAG_member, scope: !752, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagArtificial)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&usize>", scope: !680, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !770, templateParams: !20, identifier: "8e477598990e228de54bc67090ae791c")
!770 = !{!771}
!771 = !DICompositeType(tag: DW_TAG_variant_part, scope: !769, file: !2, size: 64, align: 64, elements: !772, templateParams: !20, identifier: "207e75f4b05a262610c39dc8ff99af5", discriminator: !779)
!772 = !{!773, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !771, file: !2, baseType: !774, size: 64, align: 64, extraData: i128 0)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !769, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !20, templateParams: !714, identifier: "183459de367941315e1907ec06551f7f")
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !771, file: !2, baseType: !776, size: 64, align: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !769, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !777, templateParams: !714, identifier: "5a6e95d4bcbbfefc9700702001835d9d")
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !776, file: !2, baseType: !692, size: 64, align: 64, flags: DIFlagPublic)
!779 = !DIDerivedType(tag: DW_TAG_member, scope: !769, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagArtificial)
!780 = !{!746, !781}
!781 = !DILocalVariable(name: "v", scope: !782, file: !748, line: 2488, type: !692, align: 8)
!782 = distinct !DILexicalBlock(scope: !747, file: !748, line: 2488, column: 13)
!783 = !DILocation(line: 2486, column: 15, scope: !747, inlinedAt: !784)
!784 = !DILocation(line: 47, column: 17, scope: !671)
!785 = !DILocation(line: 47, column: 33, scope: !724)
!786 = !DILocation(line: 2487, column: 15, scope: !747, inlinedAt: !784)
!787 = !DILocation(line: 2487, column: 9, scope: !747, inlinedAt: !784)
!788 = !DILocation(line: 2501, column: 21, scope: !789, inlinedAt: !793)
!789 = distinct !DISubprogram(name: "from_residual<(usize, &usize)>", linkageName: "_ZN145_$LT$core..option..Option$LT$T$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..option..Option$LT$core..convert..Infallible$GT$$GT$$GT$13from_residual17h4745653200fe557dE", scope: !790, file: !748, line: 2499, type: !791, scopeLine: 2499, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !686)
!790 = !DINamespace(name: "{impl#40}", scope: !680)
!791 = !DISubroutineType(types: !792)
!792 = !{!679, !725}
!793 = !DILocation(line: 47, column: 17, scope: !794)
!794 = !DILexicalBlockFile(scope: !724, file: !672, discriminator: 2)
!795 = !DILocation(line: 51, column: 6, scope: !671)
!796 = !DILocation(line: 2488, column: 18, scope: !747, inlinedAt: !784)
!797 = !DILocation(line: 2488, column: 18, scope: !782, inlinedAt: !784)
!798 = !DILocation(line: 2488, column: 24, scope: !782, inlinedAt: !784)
!799 = !DILocation(line: 47, column: 17, scope: !742)
!800 = !DILocation(line: 47, column: 13, scope: !722)
!801 = !DILocation(line: 48, column: 17, scope: !722)
!802 = !DILocation(line: 48, column: 13, scope: !744)
!803 = !DILocation(line: 49, column: 9, scope: !744)
!804 = !DILocation(line: 50, column: 9, scope: !744)
!805 = !DILocation(line: 46, column: 5, scope: !671)
!806 = !DILocation(line: 0, scope: !807)
!807 = !DILexicalBlockFile(scope: !671, file: !388, discriminator: 0)
!808 = distinct !DISubprogram(name: "from_iter<i32, core::ops::range::Range<i32>>", linkageName: "_ZN111_$LT$alloc..vec..Vec$LT$T$GT$$u20$as$u20$alloc..vec..spec_from_iter_nested..SpecFromIterNested$LT$T$C$I$GT$$GT$9from_iter17h583038eaf1f0bf48E", scope: !810, file: !809, line: 52, type: !813, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !875, retainedNodes: !869)
!809 = !DIFile(filename: "/rustc/4eb161250e340c8f48f66e2b929ef4a5bed7c181/library/alloc/src/vec/spec_from_iter_nested.rs", directory: "", checksumkind: CSK_MD5, checksum: "9676270e655d9a9d768f6949f90c4a85")
!810 = !DINamespace(name: "{impl#1}", scope: !811)
!811 = !DINamespace(name: "spec_from_iter_nested", scope: !812)
!812 = !DINamespace(name: "vec", scope: !220)
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !850, !856}
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<i32, alloc::alloc::Global>", scope: !812, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !816, templateParams: !848, identifier: "22d04d8da1cc9ac43c0a7977d11559f7")
!816 = !{!817, !849}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !815, file: !2, baseType: !818, size: 128, align: 64, flags: DIFlagPrivate)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<i32, alloc::alloc::Global>", scope: !819, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !820, templateParams: !848, identifier: "6daa337b782a96e6da38f638566739ca")
!819 = !DINamespace(name: "raw_vec", scope: !220)
!820 = !{!821, !843}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !818, file: !2, baseType: !822, size: 128, align: 64, flags: DIFlagPrivate)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVecInner<alloc::alloc::Global>", scope: !819, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !823, templateParams: !842, identifier: "612beef9faed005879f5bb1096ffb382")
!823 = !{!824, !837, !841}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !822, file: !2, baseType: !825, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !826, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !827, templateParams: !833, identifier: "2b03c7ea8576447d81299fe2071420ac")
!826 = !DINamespace(name: "unique", scope: !47)
!827 = !{!828, !835}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !825, file: !2, baseType: !829, size: 64, align: 64, flags: DIFlagPrivate)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !224, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !830, templateParams: !833, identifier: "2dacd11285756ee28c1afd22decc187c")
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !829, file: !2, baseType: !832, size: 64, align: 64, flags: DIFlagPrivate)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!833 = !{!834}
!834 = !DITemplateTypeParameter(name: "T", type: !16)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !825, file: !2, baseType: !836, align: 8, offset: 64, flags: DIFlagPrivate)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !263, file: !2, align: 8, flags: DIFlagPublic, elements: !20, templateParams: !833, identifier: "b08fa8c6b14040d03b39da698aa8bb0")
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !822, file: !2, baseType: !838, size: 64, align: 64, flags: DIFlagPrivate)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !819, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !839, templateParams: !20, identifier: "abfdc671658c2d47abd1e55e6bb9cdde")
!839 = !{!840}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !838, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !822, file: !2, baseType: !265, align: 8, offset: 128, flags: DIFlagPrivate)
!842 = !{!268}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !818, file: !2, baseType: !844, align: 8, offset: 128, flags: DIFlagPrivate)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<i32>", scope: !263, file: !2, align: 8, flags: DIFlagPublic, elements: !20, templateParams: !845, identifier: "67ba11e235857968bc4360bb5f7c1ee1")
!845 = !{!846}
!846 = !DITemplateTypeParameter(name: "T", type: !847)
!847 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!848 = !{!846, !268}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !815, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<i32>", scope: !207, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !851, templateParams: !854, identifier: "6f2e9bf5a5bdbf40a211842b55242c5a")
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !850, file: !2, baseType: !847, size: 32, align: 32, flags: DIFlagPublic)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !850, file: !2, baseType: !847, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!854 = !{!855}
!855 = !DITemplateTypeParameter(name: "Idx", type: !847)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !857, size: 64, align: 64, dwarfAddressSpace: 0)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !858, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !860, templateParams: !20, identifier: "5fd7821cbffcf040553a9a7c0bddd426")
!858 = !DINamespace(name: "location", scope: !859)
!859 = !DINamespace(name: "panic", scope: !31)
!860 = !{!861, !867, !868}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !857, file: !2, baseType: !862, size: 128, align: 64, flags: DIFlagPrivate)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !863, templateParams: !20, identifier: "9277eecd40495f85161460476aacc992")
!863 = !{!864, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !862, file: !2, baseType: !865, size: 64, align: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !862, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !857, file: !2, baseType: !141, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !857, file: !2, baseType: !141, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!869 = !{!870, !871, !873}
!870 = !DILocalVariable(name: "iterator", arg: 1, scope: !808, file: !809, line: 52, type: !850)
!871 = !DILocalVariable(name: "vector", scope: !872, file: !809, line: 53, type: !815, align: 8)
!872 = distinct !DILexicalBlock(scope: !808, file: !809, line: 53, column: 9)
!873 = !DILocalVariable(name: "upper", scope: !874, file: !809, line: 54, type: !9, align: 8)
!874 = distinct !DILexicalBlock(scope: !808, file: !809, line: 54, column: 13)
!875 = !{!846, !876}
!876 = !DITemplateTypeParameter(name: "I", type: !850)
!877 = !DILocation(line: 52, column: 18, scope: !808)
!878 = !DILocation(line: 53, column: 13, scope: !872)
!879 = !DILocation(line: 591, column: 44, scope: !880, inlinedAt: !1040)
!880 = distinct !DISubprogram(name: "new_const<1>", linkageName: "_ZN4core3fmt9Arguments9new_const17h35abe3fac7c7bd4dE", scope: !882, file: !881, line: 591, type: !1031, scopeLine: 591, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !20, declaration: !1037, retainedNodes: !1038)
!881 = !DIFile(filename: "/rustc/4eb161250e340c8f48f66e2b929ef4a5bed7c181/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "c11a22e991b00fe7e2b5b5eee45fabb7")
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !30, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !883, templateParams: !20, identifier: "24d7f7e486ce50cf1c25adaa5147de9")
!883 = !{!884, !890, !933}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !882, file: !2, baseType: !885, size: 128, align: 64, flags: DIFlagPrivate)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !886, templateParams: !20, identifier: "4e66b00a376d6af5b8765440fb2839f")
!886 = !{!887, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !885, file: !2, baseType: !888, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64, align: 64, dwarfAddressSpace: 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !885, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !882, file: !2, baseType: !891, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !680, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !892, templateParams: !20, identifier: "617dea99b28a3d3b34d818cede7b0f41")
!892 = !{!893}
!893 = !DICompositeType(tag: DW_TAG_variant_part, scope: !891, file: !2, size: 128, align: 64, elements: !894, templateParams: !20, identifier: "78febf55d4fb2749ce42da34674068a2", discriminator: !932)
!894 = !{!895, !928}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !893, file: !2, baseType: !896, size: 128, align: 64, extraData: i128 0)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !891, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !20, templateParams: !897, identifier: "695a32091a2b1e5197e1960e72b73265")
!897 = !{!898}
!898 = !DITemplateTypeParameter(name: "T", type: !899)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !900, templateParams: !20, identifier: "d8472b9e7866f19ba54203fac37851d7")
!900 = !{!901, !927}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !899, file: !2, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64, dwarfAddressSpace: 0)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !29, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !904, templateParams: !20, identifier: "e2deef32e12bd1dc7545d150c8f81af6")
!904 = !{!905, !906, !908, !909, !910, !926}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !903, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !903, file: !2, baseType: !907, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!907 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !903, file: !2, baseType: !28, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !903, file: !2, baseType: !141, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !903, file: !2, baseType: !911, size: 128, align: 64, flags: DIFlagPublic)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !29, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !912, templateParams: !20, identifier: "a24e77429448d4c753a6c97568ac8ce0")
!912 = !{!913}
!913 = !DICompositeType(tag: DW_TAG_variant_part, scope: !911, file: !2, size: 128, align: 64, elements: !914, templateParams: !20, identifier: "7c1587f137c92410712673ee342e2fbc", discriminator: !925)
!914 = !{!915, !919, !923}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !913, file: !2, baseType: !916, size: 128, align: 64, extraData: i128 0)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !911, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !917, templateParams: !20, identifier: "dca4769d3a77ed737190564aa38a0c6c")
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !916, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !913, file: !2, baseType: !920, size: 128, align: 64, extraData: i128 1)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !911, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !921, templateParams: !20, identifier: "23b0968d524d3d7276bd1530d690722b")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !920, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !913, file: !2, baseType: !924, size: 128, align: 64, extraData: i128 2)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !911, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !20, identifier: "e198ee774d92f0289e91e162acfb8a86")
!925 = !DIDerivedType(tag: DW_TAG_member, scope: !911, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagArtificial)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !903, file: !2, baseType: !911, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !899, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !893, file: !2, baseType: !929, size: 128, align: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !891, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !930, templateParams: !897, identifier: "904dbd0544075275fc6a07b78bdb6b3a")
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !929, file: !2, baseType: !899, size: 128, align: 64, flags: DIFlagPublic)
!932 = !DIDerivedType(tag: DW_TAG_member, scope: !891, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagArtificial)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !882, file: !2, baseType: !934, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !935, templateParams: !20, identifier: "ea645bd6f42154ff1715fa7c0686a08c")
!935 = !{!936, !1030}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !934, file: !2, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64, dwarfAddressSpace: 0)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !29, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !939, templateParams: !20, identifier: "fb5b437bc83208c91649760db9bd8119")
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !938, file: !2, baseType: !941, size: 128, align: 64, flags: DIFlagPrivate)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !29, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !942, templateParams: !20, identifier: "81f457fd55be8bb511765d85f664e0d5")
!942 = !{!943}
!943 = !DICompositeType(tag: DW_TAG_variant_part, scope: !941, file: !2, size: 128, align: 64, elements: !944, templateParams: !20, identifier: "670df6dd79b189f829202db8632c4982", discriminator: !1029)
!944 = !{!945, !1025}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !943, file: !2, baseType: !946, size: 128, align: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !941, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !947, templateParams: !20, identifier: "3cacfd609faa3ef7b72ef87e7ac0e4f1")
!947 = !{!948, !954, !1020}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !946, file: !2, baseType: !949, size: 64, align: 64, flags: DIFlagPrivate)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !224, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !950, templateParams: !952, identifier: "7a16744fcb38f9d82558b0b88981c73f")
!950 = !{!951}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !949, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!952 = !{!953}
!953 = !DITemplateTypeParameter(name: "T", type: !7)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !946, file: !2, baseType: !955, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !956, size: 64, align: 64, dwarfAddressSpace: 0)
!956 = !DISubroutineType(types: !957)
!957 = !{!958, !949, !974}
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !190, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !959, templateParams: !20, identifier: "dc39903adb7666ffe8db0185d2590a41")
!959 = !{!960}
!960 = !DICompositeType(tag: DW_TAG_variant_part, scope: !958, file: !2, size: 8, align: 8, elements: !961, templateParams: !20, identifier: "a1254b3baa0f646374ab5ad0643e1d1e", discriminator: !973)
!961 = !{!962, !969}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !960, file: !2, baseType: !963, size: 8, align: 8, extraData: i128 0)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !958, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !964, templateParams: !966, identifier: "2bbfeed2d1c7fb9d2c6255d92436dc0c")
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !963, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!966 = !{!953, !967}
!967 = !DITemplateTypeParameter(name: "E", type: !968)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !30, file: !2, align: 8, flags: DIFlagPublic, elements: !20, identifier: "9ab3b671cf38a82591a766c984615b7f")
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !960, file: !2, baseType: !970, size: 8, align: 8, extraData: i128 1)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !958, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !971, templateParams: !966, identifier: "7f61516a241b7b6a4d42ca9fe78547de")
!971 = !{!972}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !970, file: !2, baseType: !968, align: 8, offset: 8, flags: DIFlagPublic)
!973 = !DIDerivedType(tag: DW_TAG_member, scope: !958, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagArtificial)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !975, size: 64, align: 64, dwarfAddressSpace: 0)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !30, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !976, templateParams: !20, identifier: "b31b9e8ee3ed05dce131535e4216c55a")
!976 = !{!977, !1009}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !975, file: !2, baseType: !978, size: 384, align: 64, flags: DIFlagPrivate)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormattingOptions", scope: !30, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !979, templateParams: !20, identifier: "31055d3fb655e09444aea604ea0e0a6d")
!979 = !{!980, !981, !982, !996, !1008}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !978, file: !2, baseType: !141, size: 32, align: 32, offset: 288, flags: DIFlagPrivate)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !978, file: !2, baseType: !907, size: 32, align: 32, offset: 256, flags: DIFlagPrivate)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !978, file: !2, baseType: !983, size: 8, align: 8, offset: 320, flags: DIFlagPrivate)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::fmt::Alignment>", scope: !680, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !984, templateParams: !20, identifier: "901f5a81e2a6637a8343cab486eeb0")
!984 = !{!985}
!985 = !DICompositeType(tag: DW_TAG_variant_part, scope: !983, file: !2, size: 8, align: 8, elements: !986, templateParams: !20, identifier: "53773920de8a1598aac30886738bf759", discriminator: !995)
!986 = !{!987, !991}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !985, file: !2, baseType: !988, size: 8, align: 8, extraData: i128 3)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !983, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !20, templateParams: !989, identifier: "7f5fed6ed5af721ad16c411043fa3b81")
!989 = !{!990}
!990 = !DITemplateTypeParameter(name: "T", type: !37)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !985, file: !2, baseType: !992, size: 8, align: 8)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !983, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !993, templateParams: !989, identifier: "f7a9dce17fc866c2b121d877aad7ebd3")
!993 = !{!994}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !992, file: !2, baseType: !37, size: 8, align: 8, flags: DIFlagPublic)
!995 = !DIDerivedType(tag: DW_TAG_member, scope: !983, file: !2, baseType: !16, size: 8, align: 8, flags: DIFlagArtificial)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !978, file: !2, baseType: !997, size: 128, align: 64, flags: DIFlagPrivate)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !680, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !998, templateParams: !20, identifier: "5db5806570a7853d681f7f869c0fc68f")
!998 = !{!999}
!999 = !DICompositeType(tag: DW_TAG_variant_part, scope: !997, file: !2, size: 128, align: 64, elements: !1000, templateParams: !20, identifier: "80872afaff388b9c2eadf56efdacb00", discriminator: !1007)
!1000 = !{!1001, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !999, file: !2, baseType: !1002, size: 128, align: 64, extraData: i128 0)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !997, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !20, templateParams: !238, identifier: "edb7d1faa2f5a4f3e8523996f1b8fe22")
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !999, file: !2, baseType: !1004, size: 128, align: 64, extraData: i128 1)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !997, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !1005, templateParams: !238, identifier: "be32f684ba5e91642cb4742e3d0841a7")
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1004, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!1007 = !DIDerivedType(tag: DW_TAG_member, scope: !997, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagArtificial)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !978, file: !2, baseType: !997, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !975, file: !2, baseType: !1010, size: 128, align: 64, offset: 384, flags: DIFlagPrivate)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !1011, templateParams: !20, identifier: "330698baa03c07d488e882b7122519b2")
!1011 = !{!1012, !1015}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1010, file: !2, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64, dwarfAddressSpace: 0)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !20, identifier: "a25a01830f5940cb2954ab55e317ccc3")
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1010, file: !2, baseType: !1016, size: 64, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !1017, size: 64, align: 64, dwarfAddressSpace: 0)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 6, lowerBound: 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_lifetime", scope: !946, file: !2, baseType: !1021, align: 8, offset: 128, flags: DIFlagPrivate)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !263, file: !2, align: 8, flags: DIFlagPublic, elements: !20, templateParams: !1022, identifier: "3ac00dd799f5a891c067615ec124f9b6")
!1022 = !{!1023}
!1023 = !DITemplateTypeParameter(name: "T", type: !1024)
